function ostan(tag){
    let id = $(tag).find("option:selected").attr("data-val");

    let arr = new Array();

    if (id == 41) {
        arr = ['شهرستان های آذربایجان شرقی'];
    }
    if (id == 44) {
        arr = ['شهرستان های آذربایجان غربی'];
    }
    if (id == 45) {
        arr = ['شهرستان های اردبیل'];
    }
    if (id == 31) {
        arr = ['اصفهان'];
    }
    if (id == 26) {
        arr = ['البرز'];
    }
    if (id == 84) {
        arr = ['ایلام'];
    }
    if (id == 77) {
        arr = ['بوشهر'];
    }
    if (id == 21) {
        arr = ['احمدآبادمستوفي','ادران','اسلام آباد','اسلام شهر','اكبرآباد',
                'اميريه','انديشه','اوشان','آبسرد','آبعلي','باغستان','باقر شهر',
                'برغان','بومهن','پارچين','پاكدشت','پرديس','پرند','پس قلعه','پيشوا',
                'تجزيه مبادلات لشكر' ,'تهران','جاجرود','چرمسازي سالاريه','چهاردانگه',
                'حسن آباد','حومه گلندوك','خاتون آباد','خاوه','خرمدشت','دركه','دماوند',
                'رباط كريم','رزگان','رودهن','ري','سعيدآباد','سلطان آباد','سوهانك','شاهدشهر',
                'شريف آباد','شمس آباد','شهر قدس','شهرآباد','شهرجديدپرديس','شهرقدس(مويز)',
                'شهريار','شهرياربردآباد','صالح آباد','صفادشت','فرودگاه امام خميني','فرون آباد',
                'فشم','فيروزكوه','قرچك','قيام دشت','كهريزك','كيلان','گلدسته','گلستان(بهارستان)',
                'گيلاوند','لواسان','لوسان بزرگ','مارليك','مروزبهرام','ملارد','منطقه 11 پستي تهران',
                'منطقه 13 پستي تهران','منطقه 14 پستي تهران','منطقه 15 پستي تهران',
                'منطقه 16 پستي تهران','منطقه 17 پستي تهران ','منطقه 18 پستي تهران ',
                'منطقه 19 پستي تهران ','نسيم شهر(بهارستان)','نصيرآباد','واوان','وحيديه',
                'ورامين','وهن آباد'];
    }
    if (id == 38) {
        arr = ['چهارمحال و بختیاری'];
    }
    if (id == 56) {
        arr = ['خراسان جنوبی'];
    }
    if (id == 51) {
        arr = ['خراسان رضوی'];
    }
    if (id == 58) {
        arr = ['خراسان شمالی'];
    }

    if (id == 61) {
        arr = ['خوزستان'];
    }
    if (id == 24) {
        arr = ['زنجان'];
    }
    if (id == 23) {
        arr = ['سمنان'];
    }
    if (id == 54) {
        arr = ['سیستان و بلوچستان'];
    }
    if (id == 71) {
        arr = ['فارس'];
    }
    if (id == 28) {
        arr = ['قزوین'];
    }


    if (id == 25) {
        arr = ['دستجرد','سلفچگان','شهر جعفریه','قم','قنوات','كهك'];
    }
    if (id == 87) {
        arr = ['کردستان'];
    }
    if (id == 34) {
        arr = ['کرمان'];
    }
    if (id == 83) {
        arr = ['کرمانشاه'];
    }
    if (id == 74) {
        arr = ['کهکیلویه و بویراحمد'];
    }
    if (id == 17) {
        arr = ['گلستان'];
    }

    if (id == 13) {
        arr = ['گیلان'];
    }
    if (id == 66) {
        arr = ['لرستان'];
    }
    if (id == 15) {
        arr = ['مازندران'];
    }
    if (id == 86) {
        arr = ['مرکزی'];
    }
    if (id == 76) {
        arr = ['هرمزگان'];
    }
    if (id == 81) {
        arr = ['همدان'];
    }
    if (id == 35) {
        arr = ['یزد'];
    }

    $(".shahr").find("select option").remove();
    $(".mahale").find("select option").remove();

    let k = 0;

    if (arr.length > 0) {
        for (k = 0; k < arr.length; k++) {
            $(".shahr").find("select").append($("<option>", {
                text: arr[k]
            }))
        }
    }

    $(".selectpicker").selectpicker("refresh");

}





